int led = 23;
int sensor = 12;
int val = 0;
void setup() {
  pinMode(led, OUTPUT);  
  pinMode(sensor, INPUT); 
  Serial.begin(9600);
}

void loop() {
  val = digitalRead(sensor);  
  Serial.print("val = "); 
  Serial.println(val); 
  if (val == 0) { 
    digitalWrite(led, HIGH); 
  }
  else {
    digitalWrite(led, LOW); 
  }
  delay(100);
}
// LED ติดเมื่อตรวจพบกระดาษสีขาวในระยะ 15 cm ดับเมื่อตรวจไม่พบหรือวัตถุอยู่ไกลกว่า 15 cm และเมื่อทดลองกับวัตถุชนิดต่างๆ 5 ชนิดได้แก่ 
// เคสไอแพดสีชมพูอ่อนไฟติดในระยะ 14 cm,แผ่นรองเมาส์สีเขียวไฟติดในระยะ 13 cm,หมวกสีแดงไฟติดในระยะ 12 cm,ฝากระติกน้ำไฟติดในระยะ 11 cm และกระดาษสีดำ 7 cm
// จากการทดลองจะเห็นว่าระยะไฟติดจะน้อยลงต่ำกว่า 15 cm เมื่อสิ่งกีดขวางเป็นสีทึบหรือเข้มขึ้น
// สรุปได้ว่าสีของวัตถุมีผลต่อการสะท้อนของคลื่นสัญญาณ infrared ที่ปล่อยยออกมา และจะเห็นว่าวัตถุสีขาวสะท้อนคลื่นสัญญาณ infraredได้ดีกว่าสีอื่น
